
&НаКлиенте
Процедура МенюПриИзменении(Элемент)
    // Очистка табличной части "Сырьё" перед заполнением новыми данными
    Объект.Сырьё.Очистить();
    ЗаполнитьБлюда(Объект.Меню);
    ЗаполнитьРецепты(Объект.Меню);
    
    // Заполнение табличной части "Сырьё" данными из табличной части "Рецепты"
    Для каждого стр Из Объект.Рецепт Цикл
        новСтр = Объект.Сырьё.Добавить();
        новСтр.РецептНаименование = стр.Наименование;
        новСтр.РецептИзмерение = стр.Измерение;
        новСтр.РецептТребуется = стр.Требуется;
    КонецЦикла;
КонецПроцедуры        

&НаСервере
Процедура ЗаполнитьБлюда(Ссылка)
    // Очистка табличной части "Блюда" перед заполнением
    Объект.Блюда.Очистить();
    
    // Формирование запроса для получения данных для табличной части "Блюда"
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                    |   МенюМеню.Блюдо КАК Блюдо,
                    |   МенюМеню.Блюдо.Вид КАК Вид,
                    |   МенюМеню.Измерение,
                    |   МенюМеню.Количество
                    |ИЗ
                    |   Документ.Меню.Меню КАК МенюМеню
                    |ГДЕ
                    |   МенюМеню.Ссылка = &Ссылка";
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    // Заполнение табличной части "Блюда" данными из результата запроса
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.Блюда.Добавить();
        НоваяСтрока.Блюдо = Выборка.Блюдо;
        НоваяСтрока.Вид = Выборка.Вид;
        НоваяСтрока.Измерение = Выборка.Измерение;
        НоваяСтрока.Количество = Выборка.Количество;
    КонецЦикла;
КонецПроцедуры         

&НаСервере
Процедура ЗаполнитьРецепты(Ссылка)
    // Очистка табличной части "Рецепты" перед заполнением
    Объект.Рецепт.Очистить();
    
    // Формирование запроса для получения данных для табличной части "Рецепты"
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                    |   Меню.Блюдо КАК Блюдо,
                    |   Рецепты.Ссылка КАК Наименование,
                    |   Рецепты.Измерение,
                    |   Рецепты.Количество,
                    |   Рецепты.Количество * Меню.Количество КАК Требуется
                    |ИЗ
                    |   (ВЫБРАТЬ
                    |       МенюМеню.Ссылка КАК Ссылка,
                    |       МенюМеню.Блюдо КАК Блюдо,
                    |       МенюМеню.Измерение КАК Измерение,
                    |       МенюМеню.Количество КАК Количество
                    |   ИЗ
                    |       Документ.Меню.Меню КАК МенюМеню
                    |   ГДЕ
                    |       МенюМеню.Ссылка = &Ссылка) КАК Меню
                    |   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Рецепты КАК Рецепты
                    |   ПО Меню.Блюдо = Рецепты.Владелец";
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    // Заполнение табличной части "Рецепты" данными из результата запроса
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.Рецепт.Добавить();
        НоваяСтрока.Блюдо = Выборка.Блюдо;
        НоваяСтрока.Наименование = Выборка.Наименование;
        НоваяСтрока.Измерение = Выборка.Измерение;
        НоваяСтрока.Количество = Выборка.Количество;
        НоваяСтрока.Требуется = Выборка.Требуется;
    КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();
КонецПроцедуры

