

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СырьёОстатки Расход
	Движения.СырьёОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаСырьё Из Сырьё Цикл
		Движение = Движения.СырьёОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Поставщик = Константы.Организация.Получить();
		Движение.Склад = Склад;
		Движение.Сырьё = ТекСтрокаСырьё.Сырьё;
		Движение.Измерение = ТекСтрокаСырьё.Измерение;
		//Движение.Цена = ТекСтрокаСырьё.Цена;
		Движение.Количество = ТекСтрокаСырьё.Количество;
	КонецЦикла;
    Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СырьёОстаткиОстатки.Сырьё КАК Сырьё,
		|	СырьёОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	СырьёОстаткиОстатки.Склад КАК Склад,  
		|   СырьёОстаткиОстатки.Измерение КАК Измерение
		|ИЗ
		|	РегистрНакопления.СырьёОстатки.Остатки(
		|			,
		|			Склад В (&Склад)
		|				И Сырьё В (&МассивСырья)
		|					И Измерение В (&МассивИзмерений)) КАК СырьёОстаткиОстатки
		|ГДЕ
		|	СырьёОстаткиОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МассивИзмерений", Сырьё.ВыгрузитьКолонку("Измерение"));
	Запрос.УстановитьПараметр("МассивСырья", Сырьё.ВыгрузитьКолонку("Сырьё"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() ЦИКЛ
			Сообщить("На складе '" + Выборка.Склад + "'  не хватает " +
			Выборка.КоличествоОстаток* (-1) + " " + Выборка.Измерение +" сырья '" + Выборка.Сырьё + "'");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры                                        


