

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СырьёОстатки Приход
	Движения.СырьёОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаСырьё Из Сырьё Цикл
		Движение = Движения.СырьёОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Поставщик = Поставщик;
		Движение.Склад = Склад;
		Движение.Сырьё = ТекСтрокаСырьё.Сырьё;
		Движение.Измерение = ТекСтрокаСырьё.Измерение;
		Движение.Цена = ТекСтрокаСырьё.Цена;
		Движение.Количество = ТекСтрокаСырьё.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры                                        


